SunCity/src/ExchangePlans/ПоМагазину/ПоМагазину.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="26753ba7-4b4a-4352-bc06-adf7fe3e661a">
  <name>ПоМагазину</name>
  <comment>Распределенная информационная база с разделением миграции данных по магазину</comment>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиИнформативныхОстатков</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиИнформативныхОстатков</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьТокеныАвторизацииИСМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МагазиныИнформативныхОстатков</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

SunCity/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Резерв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SunCity/src/Documents/ВводНачальныхОстатковУзла/ВводНачальныхОстатковУзла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатковУзла</name>
  <registerRecords>InformationRegister.СебестоимостьНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыТоваров</registerRecords>
  <registerRecords>InformationRegister.ДействующиеЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваБезналичные</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваККМ</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.АвтономнаяРабота</types>
      <types>ExchangePlanRef.ОбменРозницаРозница</types>
      <types>ExchangePlanRef.ПоМагазину</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействующиеЦеныНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредстваККМ</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредстваБезналичные</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьБанковскийСчет</name>
      <type>
        <types>CatalogRef.УдалитьБанковскиеСчетаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДенежныеСредстваНаличные</name>
    <attributes>
      <name>Касса</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СебестоимостьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыКПоступлению</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаСкладах</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыОрганизаций</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеныНоменклатуры</name>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыКОтгрузке</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/ExchangePlans/ПоМагазину/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОписаниеТиповОбъектовКОтправкеНазад;
Перем ОписаниеТиповОбъектовКФормированиюОстатков;
Перем ОписаниеТиповПеремещениеТоваров;
Перем ОписаниеТиповВводНачальныхОстатковУзла;
Перем ОписаниеТиповОтчетОРозничныхПродажах;
Перем ТребуетсяПровестиВводНачальныхОстатковУзла;
Перем МассивОбъектовКФормированиюОстатков;
Перем МассивОтчетовОРозничныхПродажах;
Перем ОписаниеТиповПеремещение;
Перем ЭтоГлавныйУзел;

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МодульОбменДанными = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиПовтИсп");

	ИмяУзла = МодульОбменДанными.ПолучитьИмяПланаОбмена(Ссылка);
	ПредопределенныйУзел = МодульОбменДанными.ПолучитьЭтотУзелПланаОбмена(ИмяУзла);
	
	Если ПредопределенныйУзел = Ссылка
		ИЛИ ПланыОбмена.ГлавныйУзел() = Ссылка Тогда
				
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("РежимВыгрузкиИнформативныхОстатков");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаВыгрузкиДокументов");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()
		И ЭтоНовый()
		И ЭтотУзел = Ложь Тогда
		ТекстСообщения = НСтр(
		"ru = 'Ограничение базовой версии. Использование распределенных информационных баз в базовой версии не поддерживается.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	МодульОбменДаннымиСервер = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиСервер");
	Если МодульОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		ПослеЗагрузкиДанных(Отказ);
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.ПоМагазину");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	Блокировка.Заблокировать();
	
	ПерваяНастройкаУзла = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоМагазинуМагазины.Магазин КАК Магазин
	|ИЗ
	|	ПланОбмена.ПоМагазину.Магазины КАК ПоМагазинуМагазины
	|ГДЕ
	|	ПоМагазинуМагазины.Ссылка = &Ссылка
	|	И НЕ ПоМагазинуМагазины.Ссылка.ЭтотУзел";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	ПерваяНастройкаУзла = Результат.Пустой();
	МодульОбменДаннымиПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиПереопределяемый");
	Если ПерваяНастройкаУзла Тогда
		Если ЭтоНовый() Тогда
			УстановитьСсылкуНового(ПланыОбмена.ПоМагазину.ПолучитьСсылку(Новый УникальныйИдентификатор));
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиДокументов) 
			И ЗначениеЗаполнено(Код) Тогда
			МодульОбменДаннымиПереопределяемый.ЗаполнитьОстатки(Магазины.ВыгрузитьКолонку("Магазин"), ПолучитьСтруктуруЗаполненияВводаОстатковУзла(ЭтоНовый()), , Отказ);
		КонецЕсли;
	Иначе
		Если Документы.ВводНачальныхОстатковУзла.ВозможноВвестиВводОстатковДляУзла(Ссылка) Тогда
			ВводОстатков = Документы.ВводНачальныхОстатковУзла.НайтиПоРеквизиту("КодУзлаОбмена", Код);
			Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиДокументов) Тогда
				Если ВводОстатков.Пустая() Тогда 
					МодульОбменДаннымиПереопределяемый.ЗаполнитьОстатки(, ПолучитьСтруктуруЗаполненияВводаОстатковУзла(ЭтоНовый()), ВводОстатков, Отказ);
				ИначеЕсли НачалоДня(ВводОстатков.Дата) <> ДатаНачалаВыгрузкиДокументов Тогда
					ВыборкаДокументов = Документы.ВводНачальныхОстатковУзла.Выбрать(,, Новый Структура("КодУзлаОбмена", Код), "Дата");
					ПервоеВхождение = Истина;
					Пока ВыборкаДокументов.Следующий() Цикл
						ДокументВыборки = ВыборкаДокументов.ПолучитьОбъект();
						Если ПервоеВхождение Тогда
							ВводОстатков = ДокументВыборки.Ссылка;
							ПервоеВхождение = Ложь;
							Продолжить;
						КонецЕсли; 
						ДокументВыборки.УстановитьПометкуУдаления(Истина);
					КонецЦикла;
					
					МодульОбменДаннымиПереопределяемый.ЗаполнитьОстатки(, ПолучитьСтруктуруЗаполненияВводаОстатковУзла(ЭтоНовый()), ВводОстатков, Отказ);
					
					Если Не Отказ Тогда
						ДополнительныеСвойства.Вставить("ПолучениеСообщенияОбмена");
						ПланыОбмена.ЗарегистрироватьИзменения(Ссылка);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Не ВводОстатков.Пустая() Тогда
					Попытка
						ОбъектВводОстатков = ВводОстатков.ПолучитьОбъект();
						ОбъектВводОстатков.Удалить();
					Исключение
						Инфо  = ИнформацияОбОшибке();
						Отказ = Истина;
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен данными.Удаление документа ""Ввод начальных остатков узла""'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,Инфо);
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		Иначе
			МодульОбменДанными = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиПовтИсп");

			ИмяУзла = МодульОбменДанными.ПолучитьИмяПланаОбмена(Ссылка);
			ПредопределенныйУзел = МодульОбменДанными.ПолучитьЭтотУзелПланаОбмена(ИмяУзла);

			ВыборкаДокументов = Документы.ВводНачальныхОстатковУзла.Выбрать(,, Новый Структура("КодУзлаОбмена", ПредопределенныйУзел.Код), "Дата");
			Пока ВыборкаДокументов.Следующий() Цикл
				ДокументВыборки = ВыборкаДокументов.ПолучитьОбъект();
				Если ДокументВыборки <> Неопределено
					И НЕ ДокументВыборки.ПометкаУдаления
					И НЕ ДокументВыборки.Проведен Тогда
					ДокументВыборки.Узел = Ссылка;
					Если НЕ МодульОбменДаннымиПереопределяемый.ЗаписатьВводОстатков(ДокументВыборки, РежимЗаписиДокумента.Проведение) Тогда
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьОбъект(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПослеЗагрузкиДанных(Отказ)
	
	МодульОбменДаннымиПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиПереопределяемый");

	Если ТребуетсяПровестиВводНачальныхОстатковУзла Тогда
		
		ВводОстатков = Документы.ВводНачальныхОстатковУзла.НайтиПоРеквизиту("КодУзлаОбмена", ПланыОбмена.ПоМагазину.ЭтотУзел().Код);
		Если НЕ ВводОстатков.Пустая() И НЕ ВводОстатков.ПометкаУдаления Тогда

			ОбъектВводОстатков = ВводОстатков.ПолучитьОбъект();
			ДатаСверткиПодчиненных = ВводОстатков.Дата;
			Если Не ЭтоНовый() И ДатаНачалаВыгрузкиДокументов <> ДатаСверткиПодчиненных И ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПоМагазину.Ссылка
				|ИЗ
				|	ПланОбмена.ПоМагазину КАК ПоМагазину
				|ГДЕ
				|	ПоМагазину.Ссылка <> &ТекущийУзел
				|	И ПоМагазину.Ссылка <> &ЭтотУзел";
				
				Запрос.УстановитьПараметр("ТекущийУзел", Ссылка);
				Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ПоМагазину.ЭтотУзел());
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					УзелОбмена = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
					УзелОбмена.ДатаНачалаВыгрузкиДокументов = ДатаСверткиПодчиненных;
					УзелОбмена.ДополнительныеСвойства.Вставить("Загрузка", Истина);
					УзелОбмена.Записать();
				КонецЦикла;
				
			КонецЕсли;
			
			ВыборкаДокументов = Документы.ВводНачальныхОстатковУзла.Выбрать(,, Новый Структура("КодУзлаОбмена", ПланыОбмена.ПоМагазину.ЭтотУзел().Код), "Дата");
			Пока ВыборкаДокументов.Следующий() Цикл
				ДокументВыборки = ВыборкаДокументов.ПолучитьОбъект();
				Если ДокументВыборки <> Неопределено
					И НЕ ДокументВыборки.ПометкаУдаления
					И НЕ ДокументВыборки.Проведен Тогда

					Если НЕ МодульОбменДаннымиПереопределяемый.ЗаписатьВводОстатков(ДокументВыборки, РежимЗаписиДокумента.Проведение) Тогда
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивОбъектовКФормированиюОстатков.Количество() > 0 Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.Дата КАК Дата,
		|	ПеремещениеТоваров.МоментВремени КАК МоментВремени,
		|	ПеремещениеТоваров.Проведен
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В(&МассивОбъектовКФормированиюОстатков)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктОРасхожденияхПриПриемкеТоваров.Ссылка,
		|	АктОРасхожденияхПриПриемкеТоваров.Дата,
		|	АктОРасхожденияхПриПриемкеТоваров.МоментВремени,
		|	АктОРасхожденияхПриПриемкеТоваров.Проведен
		|ИЗ
		|	Документ.АктОРасхожденияхПриПриемкеТоваров КАК АктОРасхожденияхПриПриемкеТоваров
		|ГДЕ
		|	АктОРасхожденияхПриПриемкеТоваров.Ссылка В(&МассивОбъектовКФормированиюОстатков)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	МоментВремени");
		
		Запрос.УстановитьПараметр("МассивОбъектовКФормированиюОстатков", МассивОбъектовКФормированиюОстатков);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ТоварыНаСкладах = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
				ТоварыНаСкладах.Отбор.Регистратор.Установить(Выборка.Ссылка);
				
				Если Выборка.Проведен Тогда
					
					ДополнительныеСвойстваОбъекта = Новый Структура;
					ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Выборка.Ссылка, ДополнительныеСвойстваОбъекта);
					
					Документы[Выборка.Ссылка.Метаданные().Имя].ИнициализироватьДанныеДокумента(Выборка.Ссылка, ДополнительныеСвойстваОбъекта);
					
					ТаблицаДвижений = ДополнительныеСвойстваОбъекта.ТаблицыДляДвижений.ТаблицаТоварыНаСкладах;
					
					Если ТаблицаДвижений.Колонки.Найти("Регистратор") = Неопределено Тогда
						ТаблицаДвижений.Колонки.Добавить("Регистратор");
						ТаблицаДвижений.ЗаполнитьЗначения(Выборка.Ссылка, "Регистратор");
					КонецЕсли;
					
					ТоварыНаСкладах.Загрузить(ТаблицаДвижений);
				КонецЕсли;
				
				Попытка
				
					ТоварыНаСкладах.ОбменДанными.Отправитель = Ссылка;
					ТоварыНаСкладах.Записать();
					
				Исключение
					
					Инфо = ИнформацияОбОшибке();
					ТекстСообщенияОбОшибке = НСтр("ru = 'Ошибка при формировании остатков документа: %1. 
					|При загрузке данных из магазина: %2'");
					ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, КраткоеПредставлениеОшибки(Инфо), Ссылка);
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен данными.Загрузка данных'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,Инфо);
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоГлавныйУзел Тогда
		БонусныеБаллыСервер.ПровестиОтчетыОПродажахПриОбмене(МассивОтчетовОРозничныхПродажах, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	ТипЭлемента = ТипЗнч(ЭлементДанных);
	Если ОписаниеТиповОбъектовКФормированиюОстатков.СодержитТип(ТипЭлемента) Тогда
		Если ЗначениеЗаполнено(ЭлементДанных.Ссылка) Тогда
			МассивОбъектовКФормированиюОстатков.Добавить(ЭлементДанных.Ссылка);
		ИначеЕсли ЭлементДанных.Проведен Тогда
			ЭлементДанных.ОбменДанными.Отправитель = Ссылка;
			ЭлементДанных.ОбменДанными.Загрузка = Истина;
			ЭлементДанных.Записать(РежимЗаписиДокумента.Запись);
			МассивОбъектовКФормированиюОстатков.Добавить(ЭлементДанных.Ссылка);
		КонецЕсли;
	ИначеЕсли  ЭтоГлавныйУзел И ОписаниеТиповОтчетОРозничныхПродажах.СодержитТип(ТипЭлемента) Тогда
		Если ЭлементДанных.Проведен Тогда
			МассивОтчетовОРозничныхПродажах.Добавить(ЭлементДанных.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если ОписаниеТиповПеремещение.СодержитТип(ТипЭлемента) Тогда
		ОбновитьПеремещениеПоТТН(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	ТипЭлемента = ТипЗнч(ЭлементДанных);
	Если ОписаниеТиповВводНачальныхОстатковУзла.СодержитТип(ТипЭлемента) Тогда
		ТребуетсяПровестиВводНачальныхОстатковУзла = Истина;
	КонецЕсли;
	
	Если ОписаниеТиповПеремещение.СодержитТип(ТипЭлемента) Тогда
		ОбновитьПеремещениеПоТТН(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	// ОбменДанными.Загрузка
	// Если настройка обмена удаляется (не важно каким способом), то удаляем все документы ВводНачальныхОстатковУзла для этого узла. 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводНачальныхОстатковУзла.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВводНачальныхОстатковУзла КАК ВводНачальныхОстатковУзла
		|ГДЕ
		|	ВводНачальныхОстатковУзла.Узел = &Узел
		|";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ВыбДокумент = Выборка.Ссылка;
		ДокументОбъект = ВыбДокумент.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		ДокументОбъект.Удалить();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОбъект(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаВыгрузкиДокументов	= НачалоГода(ТекущаяДатаСеанса());

КонецПроцедуры

// Функция получает Структуру заполнения для документа Ввод остатков Узла.
//
Функция ПолучитьСтруктуруЗаполненияВводаОстатковУзла(НовыйУзел)
	
	СтруктураЗаполненияВводаОстатков = Новый Структура;
	СтруктураЗаполненияВводаОстатков.Вставить("Дата", ДатаНачалаВыгрузкиДокументов);
	Если НовыйУзел Тогда
		СтруктураЗаполненияВводаОстатков.Вставить("Узел", ПолучитьСсылкуНового());
	Иначе
		СтруктураЗаполненияВводаОстатков.Вставить("Узел", Ссылка);
	КонецЕсли;
	СтруктураЗаполненияВводаОстатков.Вставить("КодУзлаОбмена", Код);
	СтруктураЗаполненияВводаОстатков.Вставить("Комментарий");
	СтруктураЗаполненияВводаОстатков.Вставить("ПометкаУдаления");
	
	Возврат СтруктураЗаполненияВводаОстатков;
	
КонецФункции

Процедура ОбновитьПеремещениеПоТТН(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Если НЕ ЗначениеЗаполнено(ЭлементДанных.ТТНВходящаяЕГАИС) Тогда
		Если ЭлементДанных.ЭтоНовый() Тогда
			ИдентификаторПеремещения = СокрЛП(ЭлементДанных.ПолучитьСсылкуНового().УникальныйИдентификатор());
		Иначе
			ИдентификаторПеремещения = СокрЛП(ЭлементДанных.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
		ТТН = ИнтеграцияЕГАИСРТ.НайтиТТНПоИдентификаторуПеремещения(ИдентификаторПеремещения);
		Если ЗначениеЗаполнено(ТТН) Тогда
			ЭлементДанных.ТТНВходящаяЕГАИС = ТТН;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация
ОписаниеТиповОбъектовКОтправкеНазад = Новый ОписаниеТипов("РегистрНакопленияНаборЗаписей.ТоварыОрганизаций");
ОписаниеТиповОбъектовКФормированиюОстатков = Новый ОписаниеТипов("ДокументОбъект.ПеремещениеТоваров, ДокументОбъект.АктОРасхожденияхПриПриемкеТоваров");
ОписаниеТиповПеремещениеТоваров = Новый ОписаниеТипов("ДокументОбъект.ПеремещениеТоваров, ДокументСсылка.ПеремещениеТоваров");
ОписаниеТиповВводНачальныхОстатковУзла = Новый ОписаниеТипов("ДокументОбъект.ВводНачальныхОстатковУзла, ДокументСсылка.ВводНачальныхОстатковУзла");
ОписаниеТиповОтчетОРозничныхПродажах = Новый ОписаниеТипов("ДокументОбъект.ОтчетОРозничныхПродажах");
ОписаниеТиповПеремещение = Новый ОписаниеТипов("ДокументОбъект.ПеремещениеТоваров");

ТребуетсяПровестиВводНачальныхОстатковУзла = Ложь;
МассивОбъектовКФормированиюОстатков = Новый Массив;
МассивОтчетовОРозничныхПродажах = Новый Массив;

ЭтоГлавныйУзел = ПланыОбмена.ГлавныйУзел() = Неопределено;
#КонецОбласти

#КонецЕсли
